// 净网行动, 从我做起

//location.host === "www.baidu.com" && clearBaidu();
//let keys = ["制服"];
let keys=['制服','无码','有码','国产精品','理论片','轮理片','含羞草','爱液','按摩棒','拔出来','爆草','包二奶','暴干',
'暴奸','暴乳','爆乳','暴淫','屄','被操','被插','被干','逼奸',
'仓井空','插暴','操逼','操黑','操烂','肏你','肏死','操死','操我',
'厕奴','插比','插b','插逼','插进','插你','插我','插阴','潮吹','潮喷',
'成人dv','成人电影','成人论坛','成人小说','成人电','成人电影','成人卡通',
'成人聊','成人片','成人视','成人图','成人文','成人小','成人电影','成人论坛',
'成人色情','成人网站','成人文学','成人小说','艳情小说','成人游戏','吃精','赤裸',
'抽插','春药','大波','大力抽送','大乳','荡妇','荡女',
'多人轮','发浪','放尿','肥逼','粉穴','封面女郎','风月大陆','干死你','干穴','肛交','龟头','裹本','国产av','好嫩','豪乳','黑逼','后庭','后穴',
'换妻俱乐部','黄片','几吧','鸡吧','鸡巴','鸡奸','寂寞男','寂寞女','妓女','集体淫',
'奸情','叫床','脚交','金鳞岂是池中物','金麟岂是池中物','精液','就去日','巨屌','菊花洞','菊门',
'巨奶','巨乳','菊穴','开苞','口爆','口活','口交','口射','口淫','裤袜','狂操','狂插','浪逼',
'浪妇','浪叫','浪女','狼友','聊性','流淫','铃木麻','凌辱','漏乳','露b','乱交','乱伦','轮暴','轮操','轮奸','裸陪','买春','美逼',
'美少妇','美乳','美腿','美穴','美幼','秘唇','迷奸','密穴','蜜穴','蜜液','摸奶','摸胸','母奸','奈美','奶子',
'男奴','内射','嫩逼','嫩女','嫩穴','捏弄','女优','炮友','砲友','喷精','屁眼','品香堂','前凸后翘','强jian','强暴',
'强奸处女','情趣用品','情色','拳交','全裸','群交','惹火身材','人妻','人兽','日逼','日烂','肉棒','肉逼',
'肉唇','肉洞','肉缝','肉棍','肉茎','肉具','揉乳','肉穴','肉欲','乳爆','乳房','乳沟','乳交','乳头','三级片',
'骚逼','骚比','骚女','骚水','骚穴','色逼','色界','色猫','色盟','色情网站','色区','色色','色诱','色欲','色b',
'少年阿宾','少修正','射爽','射颜','食精','释欲','兽奸','兽交','手淫','兽欲','熟妇','熟母','熟女','爽片','爽死我了',
'双臀','死逼','丝袜','丝诱','松岛枫','酥痒','汤加丽','套弄','体奸','体位','舔脚','舔阴','调教','偷欢','偷拍','推油',
'脱内裤','文做','我就色','无码','舞女','无修正','吸精','夏川纯','相奸','小逼','校鸡','小穴','小xue','写真','性感妖娆',
'性感诱惑','性虎','性饥渴','性技巧','性交','性奴','性虐','性息','性欲','胸推','穴口','学生妹','穴图','亚情','颜射','阳具'
,'杨思敏','要射了','夜勤病栋','一本道','一夜欢','一夜情','一ye情','阴部','淫虫','阴唇','淫荡','阴道','淫电影','阴阜','淫妇','淫河','阴核','阴户',
'淫贱','淫叫','淫教师','阴茎','阴精','淫浪','淫媚','淫糜','淫魔','淫母','淫女','淫虐','淫妻','淫情','淫色','淫声浪语','淫兽学园','淫书','淫术炼金士',
'淫水','淫娃','淫威','淫亵','淫样','淫液','淫照','阴b','应召','幼交','幼男','幼女','欲火','欲女','玉女心经','玉蒲团','玉乳','欲仙欲死','玉穴','援交',
'原味内衣','援助交际','张筱雨','招鸡','招妓','中年美妇','抓胸','自拍','自慰','作爱','18禁','a片',
'gay片','g点','g片','h动画','h动漫','sm女王','xing伴侣','yin荡','欠干','婊子养的',
'性伴侣','男公关','诱奸','强奸','做爱','性爱','发生关系','快感','处男','a片','兽性','呻吟','裸露','一丝不挂','脱光','干你','干死','裙中性运动',
'乱奸','乱伦','乱伦类','乱伦小','伦理大','伦理电影','伦理毛','伦理片','裸聊','裸聊网','裸体写真','裸舞视','裸照','美女裸体','美女写真',
'美女上门','美艳少妇','妹按摩','妹上门','迷幻药','迷幻藥','迷昏口','迷昏药','迷昏藥','迷魂香','迷魂药','迷魂藥','迷奸粉','迷奸药',
'迷情粉','迷情水','迷情药','迷药','迷藥','谜奸药','骚妇','骚货','骚浪','骚女','骚嘴','色电影','色妹妹','色情表演','色情电影',
'色情服务','色情图片','色情小说','色情影片','色情表演','色情电影','色情服务','色情片','色视频','色小说','性伴侣','性服务',
'性福情','性感少','性伙伴','性交','性交视频','性交图片','性奴','性奴集中营','性虐','阴唇','阴道','阴蒂','阴户','阴间来电','阴茎',
'阴茎增大','阴茎助勃','阴毛','陰唇','陰道','陰戶','淫荡','淫荡美女','淫荡视频','淫荡照片','淫乱','淫靡','淫魔','淫魔舞','淫女',
'淫情女','淫肉','淫騷妹','淫兽','淫兽学','淫水','淫穴','迷药','爱液','按摩棒','拔出来','爆草','包二奶','暴干','暴奸','暴乳','爆乳',
'暴淫','屄','被操','被插','被干','逼奸','仓井空','插暴','操逼','操黑','操烂','肏你','肏死','操死','操我','厕奴','插比','插b','插逼',
'插进','插你','插我','插阴','潮吹','潮喷','成人电影','成人论坛','成人色情','成人网站','成人文学','成人小说','艳情小说','成人游戏',
'吃精','赤裸','抽插','扌由插','抽一插','春药','大波','大力抽送','大乳','荡妇','荡女','盗撮','多人轮','发浪','放尿','肥逼','粉穴',
'封面女郎','风月大陆','干死你','干穴','肛交','肛门','龟头','裹本','国产av','好嫩','豪乳','黑逼','后庭','后穴','虎骑',
'换妻俱乐部','黄片','几吧','鸡吧','鸡巴','鸡奸','寂寞男','寂寞女','妓女','激情','集体淫','奸情','叫床','脚交','精液','就去日','巨屌','菊花洞','菊门','巨奶','巨乳','菊穴','开苞','口爆','口活','口交','口射','口淫','裤袜','狂操','狂插','浪逼','浪妇','浪叫','浪女','狼友','聊性','流淫','铃木麻','凌辱','漏乳','露b','乱交','乱伦','轮暴','轮操','轮奸','裸陪','买春','美逼','美少妇','美乳','美腿','美穴','美幼','秘唇','迷奸','密穴','蜜穴','蜜液','摸奶','摸胸','母奸','奈美','奶子','男奴','内射','嫩逼','嫩女','嫩穴','捏弄','女优','炮友','砲友','喷精','屁眼','品香堂','前凸后翘','强jian','强暴','强奸处女','情趣用品','情色','拳交','全裸','群交','惹火身材','人妻','人兽','日逼','日烂','肉棒','肉逼','肉唇','肉洞','肉缝','肉棍','肉茎','肉具','揉乳','肉穴','肉欲','乳爆','乳房','乳沟','乳交','乳头','三级片','骚逼','骚比','骚女','骚水','骚穴','色逼','色界','色猫','色盟','色情网站','色区','色色','色诱','色欲','色b','少年阿宾','少修正','射爽','射颜','食精','释欲','兽奸','兽交','手淫','兽欲','熟妇','熟母','熟女','爽片','爽死我了','双臀','死逼','丝袜','丝诱','松岛枫','酥痒','汤加丽','套弄','体奸','体位','舔脚','舔阴','调教','偷欢','偷拍','推油','脱内裤','文做','我就色','舞女','无修正','吸精','夏川纯','相奸','小逼','校鸡','小穴','小xue','写真','性感妖娆','性感诱惑','性虎','性饥渴','性技巧','性交','性奴','性虐','性息','性欲','胸推','穴口','学生妹','穴图','亚情','颜射','阳具','杨思敏','要射了','夜勤病栋','一本道','一夜欢','一夜情','一ye情','阴部','淫虫','阴唇','淫荡','阴道','淫电影','阴阜','淫妇','淫河','阴核','阴户','淫贱','淫叫','淫教师','阴茎','阴精','淫浪','淫媚','淫糜','淫魔','淫母','淫女','淫虐','淫妻','淫情','淫色','淫声浪语','淫兽学园','淫书','淫术炼金士','淫水','淫娃','淫威','淫亵','淫样','淫液','淫照','阴b','应召','幼交','幼男','幼女','欲火','欲女','玉女心经','玉蒲团','玉乳','欲仙欲死','玉穴','援交','原味内衣','援助交际','招鸡','招妓','中年美妇','抓胸','自拍','自慰','作爱','18禁','h动画','h动漫'];

// chrome.storage.sync.get({blockWords: []}, function(items) {
//         console.log("content storage",items.blockWords);
//         keys=items.blockWords;
//         clearAll()
//         });


//1.首先读取URL黑名单列表
var black_list=[];

chrome.storage.sync.get('blacklist', (res)=>{
        console.log("content storage",res);
        black_list=res.blacklist
        for (var item of black_list){
            console.log("cyx for",item,"document.URL",document.URL);
            if(document.URL===item){
                console.log("blacklist get_out ");
                get_out();
           }
          }
        console.log("blacklist ",res.blacklist);
        });


var cur_url="";
var is_trasfer=true;

function send_message(message_str){


  chrome.runtime.sendMessage({message: message_str}, function(response) {
  console.log('收到来自后台的回复：' + response);
});

}
function get_out(){
     //u=chrome.extension.getURL('bg.html')
     //alert (u)
  //window.location.href="https://cn.bing.com/th?id=OHR.BeaverDam_ZH-CN6855160492_1920x1080.jpg&rf=LaDigue_1920x1080.jpg&pid=hp";
  //window.location.href=u

  //chrome.tabs.update(chrome.tabs.getSelected(),chrome.extension.getURL('bg.html'))
     send_message("transfer") 

}


function add_url_to_blacklist(url){
  //alert ("black_list",black_list)
  chrome.storage.sync.get('blacklist', (res)=>{
        console.log("content storage",res);
        black_list=res.blacklist
        //如果重复，返回
         for (var item of black_list) {
            //alert("item",item,"url",url)
            if(item === url) {
              console.log('一样');
              return;   
            };
          } ;//for
          //save
          black_list.push(url)
          console.log("black_list",black_list)
   
          chrome.storage.sync.set({blacklist: black_list}, function() {
                          console.log('已加入黑名单');
                  });

});


 
  
 
  
 

}


function clearAll(){
  
           
        var innerText=document.getElementsByTagName('html')[0].innerText; 

        //console.log("innerText",innerText);


      
        for (var value of keys) {
        
                  //console.log("key",keys[i])
                  if (innerText.includes(value)) {

                    //window.history.back(-1);
                      alert(value)
                    if(document.URL!="https://cn.bing.com/th?id=OHR.BeaverDam_ZH-CN6855160492_1920x1080.jpg&rf=LaDigue_1920x1080.jpg&pid=hp" ){
                      //console.log(keys[i]);
                      if (is_trasfer==true){
                        add_url_to_blacklist(document.URL)
                        //window.location.href="https://cn.bing.com/th?id=OHR.BeaverDam_ZH-CN6855160492_1920x1080.jpg&rf=LaDigue_1920x1080.jpg&pid=hp";
                        get_out()
                       
                      }
                    break;
                    }
                    
                  };
                  
                };
     
}





//1.监听页面加载完毕
document.addEventListener('readystatechange', event => {
  if (event.target.readyState === 'interactive') {
    　 cur_url=document.URL
           //不会进入 //当页面加载完文本时进入（图片还未加载） 
          console.log("interactive");
           clearAll(); 
           
   　
  }
  else if (event.target.readyState === 'complete') {
    　　　　cur_url=document.URL
          //当页面加载状态为完全结束时进入 
           clearAll(); 
           console.log("complete");
   　 }
 
else if (event.target.readyState == 'loading') {
            //不会进入
    　　　　cur_url=document.URL
           //当页面加载状态为完全结束时进入 
           console.log("loading");
           clearAll(); 
           
   　 }
  
});



//2.监听百度输入input改变
targetNode=document.getElementsByTagName('title')[0]

if (targetNode){
  let config = { attributes: true, childList: true, subtree: true };
  let callback = function (mutationsList) {
    mutationsList.forEach(function (item, index) {

      if (item.type == 'childList') {
        console.log("childList");
        clearAll();
      
      } 
    });
  };
  let observer = new MutationObserver(callback);
  observer.observe(targetNode, config);
};

